// Generated by jextract

package tech.kayys.gollek.llama;

import java.lang.foreign.*;
import java.util.function.*;
import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang = c :
 * struct llama_perf_context_data {
 *     double t_start_ms;
 *     double t_load_ms;
 *     double t_p_eval_ms;
 *     double t_eval_ms;
 *     int32_t n_p_eval;
 *     int32_t n_eval;
 *     int32_t n_reused;
 * }
 * }
 */
public class llama_perf_context_data {

    llama_perf_context_data() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            llama_h.C_DOUBLE.withName("t_start_ms"),
            llama_h.C_DOUBLE.withName("t_load_ms"),
            llama_h.C_DOUBLE.withName("t_p_eval_ms"),
            llama_h.C_DOUBLE.withName("t_eval_ms"),
            llama_h.C_INT.withName("n_p_eval"),
            llama_h.C_INT.withName("n_eval"),
            llama_h.C_INT.withName("n_reused"),
            MemoryLayout.paddingLayout(4)).withName("llama_perf_context_data");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfDouble t_start_ms$LAYOUT = (OfDouble) $LAYOUT.select(groupElement("t_start_ms"));

    /**
     * Layout for field:
     * {@snippet lang = c : * double t_start_ms
     * }
     */
    public static final OfDouble t_start_ms$layout() {
        return t_start_ms$LAYOUT;
    }

    private static final long t_start_ms$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang = c : * double t_start_ms
     * }
     */
    public static final long t_start_ms$offset() {
        return t_start_ms$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * double t_start_ms
     * }
     */
    public static double t_start_ms(MemorySegment struct) {
        return struct.get(t_start_ms$LAYOUT, t_start_ms$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * double t_start_ms
     * }
     */
    public static void t_start_ms(MemorySegment struct, double fieldValue) {
        struct.set(t_start_ms$LAYOUT, t_start_ms$OFFSET, fieldValue);
    }

    private static final OfDouble t_load_ms$LAYOUT = (OfDouble) $LAYOUT.select(groupElement("t_load_ms"));

    /**
     * Layout for field:
     * {@snippet lang = c : * double t_load_ms
     * }
     */
    public static final OfDouble t_load_ms$layout() {
        return t_load_ms$LAYOUT;
    }

    private static final long t_load_ms$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang = c : * double t_load_ms
     * }
     */
    public static final long t_load_ms$offset() {
        return t_load_ms$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * double t_load_ms
     * }
     */
    public static double t_load_ms(MemorySegment struct) {
        return struct.get(t_load_ms$LAYOUT, t_load_ms$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * double t_load_ms
     * }
     */
    public static void t_load_ms(MemorySegment struct, double fieldValue) {
        struct.set(t_load_ms$LAYOUT, t_load_ms$OFFSET, fieldValue);
    }

    private static final OfDouble t_p_eval_ms$LAYOUT = (OfDouble) $LAYOUT.select(groupElement("t_p_eval_ms"));

    /**
     * Layout for field:
     * {@snippet lang = c : * double t_p_eval_ms
     * }
     */
    public static final OfDouble t_p_eval_ms$layout() {
        return t_p_eval_ms$LAYOUT;
    }

    private static final long t_p_eval_ms$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang = c : * double t_p_eval_ms
     * }
     */
    public static final long t_p_eval_ms$offset() {
        return t_p_eval_ms$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * double t_p_eval_ms
     * }
     */
    public static double t_p_eval_ms(MemorySegment struct) {
        return struct.get(t_p_eval_ms$LAYOUT, t_p_eval_ms$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * double t_p_eval_ms
     * }
     */
    public static void t_p_eval_ms(MemorySegment struct, double fieldValue) {
        struct.set(t_p_eval_ms$LAYOUT, t_p_eval_ms$OFFSET, fieldValue);
    }

    private static final OfDouble t_eval_ms$LAYOUT = (OfDouble) $LAYOUT.select(groupElement("t_eval_ms"));

    /**
     * Layout for field:
     * {@snippet lang = c : * double t_eval_ms
     * }
     */
    public static final OfDouble t_eval_ms$layout() {
        return t_eval_ms$LAYOUT;
    }

    private static final long t_eval_ms$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang = c : * double t_eval_ms
     * }
     */
    public static final long t_eval_ms$offset() {
        return t_eval_ms$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * double t_eval_ms
     * }
     */
    public static double t_eval_ms(MemorySegment struct) {
        return struct.get(t_eval_ms$LAYOUT, t_eval_ms$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * double t_eval_ms
     * }
     */
    public static void t_eval_ms(MemorySegment struct, double fieldValue) {
        struct.set(t_eval_ms$LAYOUT, t_eval_ms$OFFSET, fieldValue);
    }

    private static final OfInt n_p_eval$LAYOUT = (OfInt) $LAYOUT.select(groupElement("n_p_eval"));

    /**
     * Layout for field:
     * {@snippet lang = c : * int32_t n_p_eval
     * }
     */
    public static final OfInt n_p_eval$layout() {
        return n_p_eval$LAYOUT;
    }

    private static final long n_p_eval$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang = c : * int32_t n_p_eval
     * }
     */
    public static final long n_p_eval$offset() {
        return n_p_eval$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * int32_t n_p_eval
     * }
     */
    public static int n_p_eval(MemorySegment struct) {
        return struct.get(n_p_eval$LAYOUT, n_p_eval$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * int32_t n_p_eval
     * }
     */
    public static void n_p_eval(MemorySegment struct, int fieldValue) {
        struct.set(n_p_eval$LAYOUT, n_p_eval$OFFSET, fieldValue);
    }

    private static final OfInt n_eval$LAYOUT = (OfInt) $LAYOUT.select(groupElement("n_eval"));

    /**
     * Layout for field:
     * {@snippet lang = c : * int32_t n_eval
     * }
     */
    public static final OfInt n_eval$layout() {
        return n_eval$LAYOUT;
    }

    private static final long n_eval$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang = c : * int32_t n_eval
     * }
     */
    public static final long n_eval$offset() {
        return n_eval$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * int32_t n_eval
     * }
     */
    public static int n_eval(MemorySegment struct) {
        return struct.get(n_eval$LAYOUT, n_eval$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * int32_t n_eval
     * }
     */
    public static void n_eval(MemorySegment struct, int fieldValue) {
        struct.set(n_eval$LAYOUT, n_eval$OFFSET, fieldValue);
    }

    private static final OfInt n_reused$LAYOUT = (OfInt) $LAYOUT.select(groupElement("n_reused"));

    /**
     * Layout for field:
     * {@snippet lang = c : * int32_t n_reused
     * }
     */
    public static final OfInt n_reused$layout() {
        return n_reused$LAYOUT;
    }

    private static final long n_reused$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang = c : * int32_t n_reused
     * }
     */
    public static final long n_reused$offset() {
        return n_reused$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * int32_t n_reused
     * }
     */
    public static int n_reused(MemorySegment struct) {
        return struct.get(n_reused$LAYOUT, n_reused$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * int32_t n_reused
     * }
     */
    public static void n_reused(MemorySegment struct, int fieldValue) {
        struct.set(n_reused$LAYOUT, n_reused$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at
     * {@code index}.
     * The returned segment has address
     * {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() {
        return layout().byteSize();
    }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using
     * {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and
     * {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and
     * {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena,
            Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}
