// Generated by jextract

package tech.kayys.gollek.llama;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang = c :
 * struct ggml_backend_dev_props {
 *     const char *name;
 *     const char *description;
 *     size_t memory_free;
 *     size_t memory_total;
 *     enum ggml_backend_dev_type type;
 *     struct ggml_backend_dev_caps caps;
 * }
 * }
 */
public class ggml_backend_dev_props {

    ggml_backend_dev_props() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            llama_h.C_POINTER.withName("name"),
            llama_h.C_POINTER.withName("description"),
            llama_h.C_LONG.withName("memory_free"),
            llama_h.C_LONG.withName("memory_total"),
            llama_h.C_INT.withName("type"),
            ggml_backend_dev_caps.layout().withName("caps")).withName("ggml_backend_dev_props");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout) $LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang = c : * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang = c : * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final AddressLayout description$LAYOUT = (AddressLayout) $LAYOUT.select(groupElement("description"));

    /**
     * Layout for field:
     * {@snippet lang = c : * const char *description
     * }
     */
    public static final AddressLayout description$layout() {
        return description$LAYOUT;
    }

    private static final long description$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang = c : * const char *description
     * }
     */
    public static final long description$offset() {
        return description$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * const char *description
     * }
     */
    public static MemorySegment description(MemorySegment struct) {
        return struct.get(description$LAYOUT, description$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * const char *description
     * }
     */
    public static void description(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(description$LAYOUT, description$OFFSET, fieldValue);
    }

    private static final OfLong memory_free$LAYOUT = (OfLong) $LAYOUT.select(groupElement("memory_free"));

    /**
     * Layout for field:
     * {@snippet lang = c : * size_t memory_free
     * }
     */
    public static final OfLong memory_free$layout() {
        return memory_free$LAYOUT;
    }

    private static final long memory_free$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang = c : * size_t memory_free
     * }
     */
    public static final long memory_free$offset() {
        return memory_free$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * size_t memory_free
     * }
     */
    public static long memory_free(MemorySegment struct) {
        return struct.get(memory_free$LAYOUT, memory_free$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * size_t memory_free
     * }
     */
    public static void memory_free(MemorySegment struct, long fieldValue) {
        struct.set(memory_free$LAYOUT, memory_free$OFFSET, fieldValue);
    }

    private static final OfLong memory_total$LAYOUT = (OfLong) $LAYOUT.select(groupElement("memory_total"));

    /**
     * Layout for field:
     * {@snippet lang = c : * size_t memory_total
     * }
     */
    public static final OfLong memory_total$layout() {
        return memory_total$LAYOUT;
    }

    private static final long memory_total$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang = c : * size_t memory_total
     * }
     */
    public static final long memory_total$offset() {
        return memory_total$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * size_t memory_total
     * }
     */
    public static long memory_total(MemorySegment struct) {
        return struct.get(memory_total$LAYOUT, memory_total$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * size_t memory_total
     * }
     */
    public static void memory_total(MemorySegment struct, long fieldValue) {
        struct.set(memory_total$LAYOUT, memory_total$OFFSET, fieldValue);
    }

    private static final OfInt type$LAYOUT = (OfInt) $LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang = c : * enum ggml_backend_dev_type type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang = c : * enum ggml_backend_dev_type type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * enum ggml_backend_dev_type type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * enum ggml_backend_dev_type type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final GroupLayout caps$LAYOUT = (GroupLayout) $LAYOUT.select(groupElement("caps"));

    /**
     * Layout for field:
     * {@snippet lang = c : * struct ggml_backend_dev_caps caps
     * }
     */
    public static final GroupLayout caps$layout() {
        return caps$LAYOUT;
    }

    private static final long caps$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang = c : * struct ggml_backend_dev_caps caps
     * }
     */
    public static final long caps$offset() {
        return caps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * struct ggml_backend_dev_caps caps
     * }
     */
    public static MemorySegment caps(MemorySegment struct) {
        return struct.asSlice(caps$OFFSET, caps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * struct ggml_backend_dev_caps caps
     * }
     */
    public static void caps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, caps$OFFSET, caps$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at
     * {@code index}.
     * The returned segment has address
     * {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() {
        return layout().byteSize();
    }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using
     * {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and
     * {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and
     * {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena,
            Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}
