// Generated by jextract

package tech.kayys.gollek.llama;

import java.lang.foreign.*;
import java.util.function.*;
import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang = c :
 * struct llama_opt_params {
 *     uint32_t n_ctx_train;
 *     llama_opt_param_filter param_filter;
 *     void *param_filter_ud;
 *     ggml_opt_get_optimizer_params get_opt_pars;
 *     void *get_opt_pars_ud;
 *     enum ggml_opt_optimizer_type optimizer_type;
 * }
 * }
 */
public class llama_opt_params {

    llama_opt_params() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            llama_h.C_INT.withName("n_ctx_train"),
            MemoryLayout.paddingLayout(4),
            llama_h.C_POINTER.withName("param_filter"),
            llama_h.C_POINTER.withName("param_filter_ud"),
            llama_h.C_POINTER.withName("get_opt_pars"),
            llama_h.C_POINTER.withName("get_opt_pars_ud"),
            llama_h.C_INT.withName("optimizer_type"),
            MemoryLayout.paddingLayout(4)).withName("llama_opt_params");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt n_ctx_train$LAYOUT = (OfInt) $LAYOUT.select(groupElement("n_ctx_train"));

    /**
     * Layout for field:
     * {@snippet lang = c : * uint32_t n_ctx_train
     * }
     */
    public static final OfInt n_ctx_train$layout() {
        return n_ctx_train$LAYOUT;
    }

    private static final long n_ctx_train$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang = c : * uint32_t n_ctx_train
     * }
     */
    public static final long n_ctx_train$offset() {
        return n_ctx_train$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * uint32_t n_ctx_train
     * }
     */
    public static int n_ctx_train(MemorySegment struct) {
        return struct.get(n_ctx_train$LAYOUT, n_ctx_train$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * uint32_t n_ctx_train
     * }
     */
    public static void n_ctx_train(MemorySegment struct, int fieldValue) {
        struct.set(n_ctx_train$LAYOUT, n_ctx_train$OFFSET, fieldValue);
    }

    private static final AddressLayout param_filter$LAYOUT = (AddressLayout) $LAYOUT
            .select(groupElement("param_filter"));

    /**
     * Layout for field:
     * {@snippet lang = c : * llama_opt_param_filter param_filter
     * }
     */
    public static final AddressLayout param_filter$layout() {
        return param_filter$LAYOUT;
    }

    private static final long param_filter$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang = c : * llama_opt_param_filter param_filter
     * }
     */
    public static final long param_filter$offset() {
        return param_filter$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * llama_opt_param_filter param_filter
     * }
     */
    public static MemorySegment param_filter(MemorySegment struct) {
        return struct.get(param_filter$LAYOUT, param_filter$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * llama_opt_param_filter param_filter
     * }
     */
    public static void param_filter(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(param_filter$LAYOUT, param_filter$OFFSET, fieldValue);
    }

    private static final AddressLayout param_filter_ud$LAYOUT = (AddressLayout) $LAYOUT
            .select(groupElement("param_filter_ud"));

    /**
     * Layout for field:
     * {@snippet lang = c : * void *param_filter_ud
     * }
     */
    public static final AddressLayout param_filter_ud$layout() {
        return param_filter_ud$LAYOUT;
    }

    private static final long param_filter_ud$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang = c : * void *param_filter_ud
     * }
     */
    public static final long param_filter_ud$offset() {
        return param_filter_ud$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * void *param_filter_ud
     * }
     */
    public static MemorySegment param_filter_ud(MemorySegment struct) {
        return struct.get(param_filter_ud$LAYOUT, param_filter_ud$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * void *param_filter_ud
     * }
     */
    public static void param_filter_ud(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(param_filter_ud$LAYOUT, param_filter_ud$OFFSET, fieldValue);
    }

    private static final AddressLayout get_opt_pars$LAYOUT = (AddressLayout) $LAYOUT
            .select(groupElement("get_opt_pars"));

    /**
     * Layout for field:
     * {@snippet lang = c : * ggml_opt_get_optimizer_params get_opt_pars
     * }
     */
    public static final AddressLayout get_opt_pars$layout() {
        return get_opt_pars$LAYOUT;
    }

    private static final long get_opt_pars$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang = c : * ggml_opt_get_optimizer_params get_opt_pars
     * }
     */
    public static final long get_opt_pars$offset() {
        return get_opt_pars$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * ggml_opt_get_optimizer_params get_opt_pars
     * }
     */
    public static MemorySegment get_opt_pars(MemorySegment struct) {
        return struct.get(get_opt_pars$LAYOUT, get_opt_pars$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * ggml_opt_get_optimizer_params get_opt_pars
     * }
     */
    public static void get_opt_pars(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(get_opt_pars$LAYOUT, get_opt_pars$OFFSET, fieldValue);
    }

    private static final AddressLayout get_opt_pars_ud$LAYOUT = (AddressLayout) $LAYOUT
            .select(groupElement("get_opt_pars_ud"));

    /**
     * Layout for field:
     * {@snippet lang = c : * void *get_opt_pars_ud
     * }
     */
    public static final AddressLayout get_opt_pars_ud$layout() {
        return get_opt_pars_ud$LAYOUT;
    }

    private static final long get_opt_pars_ud$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang = c : * void *get_opt_pars_ud
     * }
     */
    public static final long get_opt_pars_ud$offset() {
        return get_opt_pars_ud$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * void *get_opt_pars_ud
     * }
     */
    public static MemorySegment get_opt_pars_ud(MemorySegment struct) {
        return struct.get(get_opt_pars_ud$LAYOUT, get_opt_pars_ud$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * void *get_opt_pars_ud
     * }
     */
    public static void get_opt_pars_ud(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(get_opt_pars_ud$LAYOUT, get_opt_pars_ud$OFFSET, fieldValue);
    }

    private static final OfInt optimizer_type$LAYOUT = (OfInt) $LAYOUT.select(groupElement("optimizer_type"));

    /**
     * Layout for field:
     * {@snippet lang = c : * enum ggml_opt_optimizer_type optimizer_type
     * }
     */
    public static final OfInt optimizer_type$layout() {
        return optimizer_type$LAYOUT;
    }

    private static final long optimizer_type$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang = c : * enum ggml_opt_optimizer_type optimizer_type
     * }
     */
    public static final long optimizer_type$offset() {
        return optimizer_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang = c : * enum ggml_opt_optimizer_type optimizer_type
     * }
     */
    public static int optimizer_type(MemorySegment struct) {
        return struct.get(optimizer_type$LAYOUT, optimizer_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang = c : * enum ggml_opt_optimizer_type optimizer_type
     * }
     */
    public static void optimizer_type(MemorySegment struct, int fieldValue) {
        struct.set(optimizer_type$LAYOUT, optimizer_type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at
     * {@code index}.
     * The returned segment has address
     * {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() {
        return layout().byteSize();
    }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using
     * {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and
     * {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and
     * {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena,
            Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}
