{
  "model_type": "gemma4",
  "architectures": ["Gemma4ForConditionalGeneration"],
  "hidden_size": 2304,
  "num_hidden_layers": 26,
  "num_attention_heads": 8,
  "num_key_value_heads": 4,
  "intermediate_size": 9216,
  "vocab_size": 262144,
  "torch_dtype": "bfloat16"
}
